---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlopeTailInsideSlopeLine
source: html/78569147-0d22-e782-db88-c6ac20692e4a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlopeTailInsideSlopeLine Property

The tails of slope arrows must not lie in interior of slope defining lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId SlopeTailInsideSlopeLine { get; }
```